I-SYST/EHAL/ARM/Nordic/nRF51/exemples/Blinky_ble/src/BlinkyBleMain.c
#define NRF_CLOCK_LFCLKSRC      {.source        = NRF_CLOCK_LF_SRC_RC,            \
                                 .rc_ctiv       = 1,                                \
                                 .rc_temp_ctiv  = 1,                                \
                                 .xtal_accuracy = 0 }//NRF_CLOCK_LF_XTAL_ACCURACY_20_PPM}

static uint8_t m_beacon_info[APP_BEACON_INFO_LENGTH] =                    /**< Information advertised by the Beacon. */
{
    APP_DEVICE_TYPE,     // Manufacturer specific information. Specifies the device type in this
                         // implementation.
    APP_ADV_DATA_LENGTH, // Manufacturer specific information. Specifies the length of the
                         // manufacturer specific data in this implementation.
    APP_BEACON_UUID,     // 128 bit UUID value.
    APP_MAJOR_VALUE,     // Major arbitrary value that can be used to distinguish between Beacons.
    APP_MINOR_VALUE,     // Minor arbitrary value that can be used to distinguish between Beacons.
    APP_MEASURED_RSSI    // Manufacturer specific information. The Beacon's measured TX power in
                         // this implementation.
};

APP_TIMER_DEF(g_BatTimerId);
app_gpiote_user_id_t				g_GpioteId = 0;
static ble_blinkys_t				g_BlinkyServ;
ble_bas_t                        	g_BatServ;                                         /**< Structure used to identify the battery service. */
static ble_gap_sec_params_t         g_GAPSecParams;                                  /**< Security requirements for this application. */
//static int8_t                       g_LastConnectedCentral;                   /**< BondManager reference handle to the last connected central. */
static dm_application_instance_t    g_AppHandle; /**< Application identifier allocated by device manager */
static ble_dfu_t                             m_dfus;                                    /**< Structure used to identify the DFU service. */


// GPIOTE event handler.
static void gpiote_event_handler(uint32_t event_pins_low_to_high, uint32_t event_pins_high_to_low)
{
	uint8_t data[16];
	uint32_t *p = (uint32_t *)data;

	*p = event_pins_low_to_high | event_pins_high_to_low;
	p++;
	*p = NRF_GPIO->IN;

	ble_blinkys_on_data_change(&g_BlinkyServ, data, 2 * sizeof(uint32_t));
}




/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in]   line_num   Line number of the failing ASSERT call.
 * @param[in]   file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
	#define DEAD_BEEF	0xDEADBEEF                                  /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */

    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


/**@brief Function for handling Service errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void service_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}

/**@brief Function for the GAP initialization.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name, appearance, and the preferred connection parameters.
 */
static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,  (const uint8_t *)PRODUCT_NAME, strlen(PRODUCT_NAME));
    APP_ERROR_CHECK(err_code);

    err_code = sd_ble_gap_appearance_set(BLE_APPEARANCE_UNKNOWN);
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the Advertising functionality.
 *
 * @details Encodes the required advertising data and passes it to the stack.
 *          Also builds a structure to be passed to the stack when starting advertising.
 */
static void advertising_init(void)
{
    uint32_t      err_code;
    ble_advdata_t advdata;
    ble_advdata_t scanrsp;
    uint8_t       flags = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
    ble_advdata_manuf_data_t data;
    uint64_t		id;

    ble_uuid_t blueio_uuids[] =
    {
        {BLINKY_UUID_SERVICE,						g_BlinkyServ.uuid_type},
    };
    ble_uuid_t std_uuids[] =
    {
//		{BLE_UUID_BATTERY_SERVICE,            		BLE_UUID_TYPE_BLE},
		{BLE_UUID_DEVICE_INFORMATION_SERVICE, 		BLE_UUID_TYPE_BLE}

    };

    id = ((uint64_t)NRF_FICR->DEVICEID[1] << 32) | (uint64_t)NRF_FICR->DEVICEID[0];

    data.company_identifier = 0x004c;	//	0x2082;
    data.data.p_data = (uint8_t *) m_beacon_info;//(uint8_t*)&id;
    data.data.size = APP_BEACON_INFO_LENGTH;//sizeof(id);

    // Build and set advertising data
    memset(&advdata, 0, sizeof(advdata));

    advdata.name_type               = BLE_ADVDATA_NO_NAME;
    advdata.include_appearance      = false;
    //advdata.flags.size              = sizeof(flags);
    //advdata.flags.p_data            = &flags;
    advdata.flags                   = flags;
    advdata.p_manuf_specific_data = &data;
    //advdata.uuids_complete.uuid_cnt = sizeof(std_uuids) / sizeof(std_uuids[0]);
    //advdata.uuids_complete.p_uuids  = std_uuids;

    memset(&scanrsp, 0, sizeof(scanrsp));
    scanrsp.uuids_complete.uuid_cnt = sizeof(blueio_uuids) / sizeof(blueio_uuids[0]);
    scanrsp.uuids_complete.p_uuids  = blueio_uuids;
    //scanrsp.p_manuf_specific_data = &data;

