I-SYST/EHAL/ARM/Nordic/nRF51/exemples/Blinky_ble/src/BlinkyBleMain.c
/**@brief Function for handling the Application's BLE Stack events.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 */
static void on_ble_evt(ble_evt_t * p_ble_evt)
{
    uint32_t        err_code;

    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_CONNECTED:
            nrf_gpio_pin_set(LED_CON);

            g_BlinkyServ.conn_handle  = p_ble_evt->evt.gap_evt.conn_handle;
            break;

        case BLE_GAP_EVT_DISCONNECTED:
            nrf_gpio_pin_clear(LED_CON);
            g_BlinkyServ.conn_handle = BLE_CONN_HANDLE_INVALID;

            advertising_start();

            // Go to system-off mode, should not return from this function, wakeup will trigger
            // a reset.
            //system_off_mode_enter();
            break;

        case BLE_GAP_EVT_SEC_PARAMS_REQUEST:
       //     err_code = sd_ble_gap_sec_params_reply(g_BlinkyServ.conn_handle,
       //                                            BLE_GAP_SEC_STATUS_SUCCESS,
       //                                            &g_GAPSecParams);
         //   APP_ERROR_CHECK(err_code);
            break;

        case BLE_GAP_EVT_TIMEOUT:
            if (p_ble_evt->evt.gap_evt.params.timeout.src == BLE_GAP_TIMEOUT_SRC_ADVERTISING)
            {
            	nrf_gpio_pin_set(24);

                    // Go to system-off mode.
                    // (this function will not return; wakeup will cause a reset).
                    err_code = sd_power_system_off();
                    APP_ERROR_CHECK(err_code);
            }
            break;

        case BLE_GATTC_EVT_TIMEOUT:
        case BLE_GATTS_EVT_TIMEOUT:
            // Disconnect on GATT Server and Client timeout events.
            err_code = sd_ble_gap_disconnect(g_BlinkyServ.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
            break;

        default:
            // No implementation needed.
            break;
    }
}

/**@brief Function for dispatching a BLE stack event to all modules with a BLE stack event handler.
 *
 * @details This function is called from the scheduler in the main loop after a BLE stack
 *          event has been received.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 */
static void ble_evt_dispatch(ble_evt_t * p_ble_evt)
{
    dm_ble_evt_handler(p_ble_evt);
    ble_blinkys_on_ble_evt(&g_BlinkyServ, p_ble_evt);
    ble_bas_on_ble_evt(&g_BatServ, p_ble_evt);
    ble_conn_params_on_ble_evt(p_ble_evt);
    /** @snippet [Propagating BLE Stack events to DFU Service] */
    //ble_dfu_on_ble_evt(&m_dfus, p_ble_evt);
    /** @snippet [Propagating BLE Stack events to DFU Service] */
    on_ble_evt(p_ble_evt);
}

/**@brief Function for dispatching a system event to interested modules.
 *
 * @details This function is called from the System event interrupt handler after a system
 *          event has been received.
 *
 * @param[in]   sys_evt   System stack event.
 */
static void sys_evt_dispatch(uint32_t sys_evt)
{
    pstorage_sys_event_handler(sys_evt);
}

/**@brief Function for initializing the BLE stack.
 *
 * @details Initializes the SoftDevice and the BLE event interrupt.
 */
static void ble_stack_init(void)
{
    uint32_t err_code;

    nrf_clock_lf_cfg_t clock_lf_cfg = NRF_CLOCK_LFCLKSRC;

    // Initialize the SoftDevice handler module.
    SOFTDEVICE_HANDLER_APPSH_INIT(&clock_lf_cfg, NULL);

    ble_enable_params_t ble_enable_params;
    err_code = softdevice_enable_get_default_config(CENTRAL_LINK_COUNT,
                                                    PERIPHERAL_LINK_COUNT,
                                                    &ble_enable_params);
    APP_ERROR_CHECK(err_code);

#ifdef BLE_DFU_APP_SUPPORT
    ble_enable_params.gatts_enable_params.service_changed = 1;
#endif // BLE_DFU_APP_SUPPORT
    //Check the ram settings against the used number of links
    CHECK_RAM_START_ADDR(CENTRAL_LINK_COUNT,PERIPHERAL_LINK_COUNT);

    // Enable BLE stack.
    err_code = softdevice_enable(&ble_enable_params);
    APP_ERROR_CHECK(err_code);

    // Register with the SoftDevice handler module for BLE events.
    err_code = softdevice_ble_evt_handler_set(ble_evt_dispatch);
    APP_ERROR_CHECK(err_code);

    // Register with the SoftDevice handler module for BLE events.
    err_code = softdevice_sys_evt_handler_set(sys_evt_dispatch);
    APP_ERROR_CHECK(err_code);
}

static void blinkys_write_handler(ble_blinkys_t * p_blinkys, uint8_t *data, int len)
{
	BLINKY_CMD *p = (BLINKY_CMD *)data;
	int l = len / sizeof(BLINKY_CMD);

	for (int i = 0; i < l; i++)
	{
		switch (p->cmd)
		{
			case BLINKY_CMD_OFF:
				nrf_gpio_pin_clear(p->iopin);
				break;
			case BLINKY_CMD_ON:
				nrf_gpio_pin_set(p->iopin);
				break;
			case BLINKY_CMD_CFGOUTPUT:
				nrf_gpio_cfg_output(p->iopin);
				break;
			case BLINKY_CMD_CFGINPUT:
			    nrf_gpio_cfg_input(p->iopin, NRF_GPIO_PIN_PULLUP);
				break;
		}
    }
}

/**@brief Function for initializing the services that will be used by the application.
 *
 * @details Initialize the Heart Rate, Battery and Device Information services.
 */
static void services_init(void)
{
	ble_blinkys_init_t blinkyscfg;

	blinkyscfg.write_handler = blinkys_write_handler;
	ble_blinkys_init(&g_BlinkyServ, &blinkyscfg);

    /** @snippet [DFU BLE Service initialization] */
    ble_dfu_init_t   dfus_init;

    // Initialize the Device Firmware Update Service.
    memset(&dfus_init, 0, sizeof(dfus_init));

    //dfus_init.evt_handler    = dfu_app_on_dfu_evt;
    //dfus_init.error_handler  = NULL; //service_error_handler - Not used as only the switch from app to DFU mode is required and not full dfu service.

    //uint32_t err_code = ble_dfu_init(&m_dfus, &dfus_init);
   // APP_ERROR_CHECK(err_code);

   // dfu_app_reset_prepare_set(reset_prepare);
    /** @snippet [DFU BLE Service initialization] */
}

void BLEStart(void)
{
	// Initialize Bluetooth Stack parameters
	g_BlinkyServ.conn_handle = BLE_CONN_HANDLE_INVALID;

	ble_stack_init();
	services_init();
	device_manager_init();
	gap_params_init();
    //bas_init();
    dis_init();
	advertising_init();
	conn_params_init();
	sec_params_init();

	// Start advertising
	advertising_start();
}

static void timers_init(void)
{
    uint32_t err_code;

    // Initialize timer module.
    APP_TIMER_APPSH_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, false);

    // Create timers.
  //  err_code = app_timer_create(&m_battery_timer_id,
  //                              APP_TIMER_MODE_REPEATED,
  //                              battery_level_meas_timeout_handler);
   // APP_ERROR_CHECK(err_code);

    //err_code = app_timer_create(&m_heart_rate_timer_id,
    //                            APP_TIMER_MODE_REPEATED,
    //                            heart_rate_meas_timeout_handler);
    //APP_ERROR_CHECK(err_code);
}

void blink()
{
	int cnt = 10;
	while (cnt-- > 0)
	{
		nrf_gpio_pin_set(30);
		for (int i=0; i < 500; i++)
			usDelay(1000);
		nrf_gpio_pin_clear(30);
		for (int i=0; i < 500; i++)
			usDelay(1000);
	}
}

int main()
{
//	NRF_POWER->DCDCEN = 1;
	uint32_t err_code;

	APP_GPIOTE_INIT(APP_GPIOTE_MAX_USERS);
	nrf_gpio_cfg_output(LED_CON);
	//blink();
	APP_SCHED_INIT(SCHED_MAX_EVENT_DATA_SIZE, SCHED_QUEUE_SIZE);
	timers_init();

	nrf_gpio_pin_clear(LED_CON);
	err_code = app_gpiote_user_register(&g_GpioteId,
	                                  0xffffffff,
	                                  0xffffffff,
	                                  gpiote_event_handler);
	APP_ERROR_CHECK(err_code);

	BLEStart();
	app_gpiote_user_enable(g_GpioteId);
//	timers_start();
//	blink();


	while (1)
	{
		app_sched_execute();
		err_code = sd_app_evt_wait();
		APP_ERROR_CHECK(err_code);
		//BlueIOADCStart();
	}
}
